const fs = global.nodemodule["fs-extra"];
module.exports.config = {
  name: "شيري",
  version: "1.0.1",
  hasPermssion: 0,
  credits: "𝐏𝐫𝐢𝐲𝐚𝐧𝐬𝐡 𝐑𝐚𝐣𝐩𝐮𝐭",
  description: "Ranmdom a Shayri",
  commandCategory: "group",
  usages: "shayri",
  cooldowns: 5,
};
module.exports.handleEvent = async function({ api, event, args, Threads, Users }) {
  var { threadID, messageID, reason } = event;
  const moment = require("moment-timezone");
  const time = moment.tz("Asia/Kolkata").format("HH:MM:ss L");
  var idgr = `${event.threadID}`;
  var id = event.senderID;
  var name = await Users.getNameUser(event.senderID);

  var tl = ["عندما يمكن انتزاع الروح من الجسد، فلماذا لا يستطيع الناس الخروج من القلب؟ " , "كانت لدي رغبة كبيرة أن أسميها حبيبتي، لكن قبل أن تصل الكلمات لشفتيّ، أصبحت غريبة. " , "بريئة جدًا، كأنها لا تفهم شيئًا، تسألني بلمعة في عينها لماذا نبضات قلبي سريعة هكذا." , "يمكنني الانتظار طوال حياتي، فقط أسأل الله ألا تكوني خائنة." , "أضيع في ظل خصلات شعركِ، أنتِ تضحكين، وآخذ نصيبكِ من الدموع وأبكي." , "تسألين كثيرًا، لو أحببتِ بنفس القدر، لكنتِ حصلتِ على الجواب. " , "في كل كلمة منكِ كان هناك خداع، كنتِ كتمثال من حجر، لكني ظننتكِ هدية من الله." , "أصعب لحظة هي عندما لا نستطيع أن نقرر: هل ننسى، أم ننتظر؟" , "لا أحتاج إلى بيت شعر، أنا وحدي أوازي جمال مجلسٍ كامل." , "لا أحتاج إلى بيت شعر، أنا وحدي أوازي جمال مجلسٍ كامل." , "أردتُ كثيرًا أن أقترب، لكن الحب كان موجودًا فقط في المسافات." , "أردتُ كثيرًا أن أقترب، لكن الحب كان موجودًا فقط في المسافات." , "في كل قصة من حياتي، تأتي أنت، لكن لماذا لا تكون في نصيبي؟" , "🍁😍__𝘚𝘶𝘯𝘢 𝘏𝘢ıı 𝘒ıı 𝘋𝘶𝘸𝘢 𝘒𝘢𝘣𝘰𝘰𝘭 𝘒𝘳𝘯𝘦 𝘒𝘢 𝘛𝘦𝘳𝘢 𝘌𝘬 𝘞𝘢𝘲𝘵 𝘏𝘰𝘵𝘵𝘢 𝘏𝘢ıı 𝘌-𝘒𝘩𝘶𝘥𝘢 𝘈𝘣 𝘛𝘶 𝘏ıı 𝘉𝘵𝘢 𝘔𝘢ıı𝘯𝘦 𝘜𝘴𝘩𝘦 𝘒ıı𝘴 𝘞𝘢𝘲𝘵 𝘕𝘩ıı 𝘔𝘢𝘯𝘨𝘢𝘢 🥺🥶" , "🍒🙊... 𝘒ıı𝘴 𝘛𝘢𝘳𝘩𝘢 𝘒𝘳𝘦 𝘒𝘩𝘶𝘥 𝘒𝘰 𝘛𝘦𝘳𝘸 𝘗𝘺𝘢𝘳 𝘒𝘦 𝘒𝘢𝘣ıı𝘭 𝘏𝘶𝘮... 𝘈𝘢𝘥𝘢𝘵𝘵𝘦 𝘉𝘢𝘥𝘭𝘵𝘸 𝘏𝘢ıı 𝘖𝘳 𝘛𝘶𝘮 𝘚𝘩𝘢𝘳𝘵 𝘉𝘢𝘥𝘢𝘭 𝘥𝘦𝘵𝘦 𝘏𝘰 😈 " , "🥺🍒__𝘞𝘰 𝘉𝘰𝘭𝘵ıı 𝘛𝘩ıı 𝘒ıı 𝘛𝘶𝘮𝘩𝘢𝘳𝘦 𝘗𝘺𝘢𝘳 𝘒𝘦 𝘓ıı𝘺𝘦 𝘔𝘢ıı𝘯 𝘈𝘱𝘯ıı 𝘑𝘢𝘢𝘯 𝘉𝘩ıı 𝘋𝘦 𝘋𝘶𝘯𝘎ıı 𝘖𝘳 𝘈𝘢𝘫 𝘝𝘩ıı 𝘉𝘰𝘭 𝘙𝘩ıı 𝘏𝘢ıı 𝘒ıı 𝘊𝘩𝘩𝘰𝘥 𝘔𝘶𝘫𝘦 𝘔𝘦𝘳ıı 𝘡ıı𝘯𝘥𝘢𝘨ı 𝘒𝘢 𝘚𝘸𝘢𝘭 𝘏𝘢ıı 🙊 " , "🙊😈_𝘏𝘶𝘮𝘯𝘦 𝘏𝘢𝘳 𝘉𝘢𝘢𝘳 𝘉𝘢𝘥𝘭𝘢 𝘏𝘢ıı 𝘒𝘩𝘶𝘥 𝘒𝘰 𝘚𝘩ıı𝘳𝘧 𝘜𝘯𝘬𝘦 𝘓ıı𝘠𝘦 𝘈𝘶𝘳 𝘈𝘣 𝘞𝘰 𝘒𝘩𝘢𝘵𝘸 𝘩𝘢ıı 𝘒ıı 𝘛𝘶𝘮 𝘗𝘩𝘭𝘦 𝘑𝘢ıı𝘴𝘦 𝘕𝘩ıı 𝘙𝘩𝘦 :💔 " , "🍷🍒__𝘛𝘶𝘮𝘩𝘦 𝘈𝘱𝘯𝘢 𝘒𝘢𝘩𝘯𝘦 𝘒ıı 𝘉𝘢𝘥𝘪 𝘛𝘢𝘮𝘮𝘯𝘢 𝘛𝘩ıı 𝘋𝘪𝘭 𝘔𝘦 𝘓𝘢𝘣𝘰𝘯 𝘛𝘢𝘬 𝘈𝘢𝘵𝘦 𝘈𝘢𝘵𝘦 𝘛𝘶𝘮 𝘎𝘢ıı𝘳 𝘏𝘰 𝘎𝘺𝘦 :))*💚 " , " 💅💋 ...𝘔𝘢ıı𝘯𝘦 𝘒𝘢𝘣𝘩ıı 𝘕𝘩ıı 𝘒𝘢𝘩𝘢 𝘒ıı 𝘛𝘶 𝘉𝘩ıı 𝘔𝘶𝘫𝘦 𝘉𝘦𝘱𝘢𝘯𝘩𝘢𝘢 𝘗𝘺𝘢𝘳 𝘒𝘢𝘳 𝘉𝘴 𝘐𝘵𝘯𝘪𝘪 𝘚𝘩ıı 𝘒𝘩𝘢𝘸𝘢ıı𝘴 𝘏𝘢ıı 𝘒ıı 𝘛𝘶 𝘔𝘶𝘫𝘦 𝘔𝘢𝘩𝘴𝘰𝘰𝘴 𝘛𝘰 𝘒𝘢𝘳 :))*💚" , "😈🙊...𝘛𝘶𝘮 𝘛𝘰 𝘒𝘩𝘢𝘵𝘸 𝘛𝘩𝘦 𝘒ıı 𝘏𝘢𝘳 𝘚𝘩𝘢𝘮 𝘛𝘦𝘳𝘸 𝘚𝘩𝘢𝘵 𝘎𝘶𝘫𝘢𝘳𝘦𝘪𝘯𝘨𝘸 𝘛𝘶𝘮 𝘉𝘢𝘥𝘢𝘭 𝘎𝘺𝘸 𝘏𝘰 𝘠𝘢𝘢 𝘛𝘦𝘳𝘸 𝘚𝘩𝘢𝘳 𝘔𝘦 𝘈𝘣 𝘚𝘩𝘢𝘮 𝘕𝘩ıı 𝘏𝘰𝘵𝘵ıı🍷🤟 " , "🍒🌾 ...𝘗𝘵𝘢 𝘕𝘩ıı 𝘒𝘢𝘣 𝘑𝘢𝘺𝘨ıı 𝘛𝘦𝘳ıı 𝘓𝘢𝘢𝘱𝘳𝘸𝘢𝘺ıı 𝘒ıı 𝘈𝘢𝘥𝘢𝘵 𝘒𝘶𝘤𝘩 𝘛𝘰𝘩 𝘚𝘮𝘣𝘩𝘢𝘭 𝘒𝘳 𝘙𝘢𝘬𝘩𝘵ıı 𝘗𝘢𝘨𝘭 𝘔𝘶𝘫𝘦 𝘉𝘩ıı 𝘒𝘩𝘰 𝘋ıı𝘺𝘈 🍎" , "🪴🌻 ...𝘒𝘺𝘜 𝘒𝘩𝘦𝘭𝘵𝘦 𝘏𝘰 𝘛𝘶𝘮 𝘏𝘶𝘮𝘚𝘩𝘦 𝘔𝘢𝘩𝘰𝘣𝘣𝘢𝘵 𝘒𝘢 𝘒𝘩𝘦𝘭 𝘉𝘢𝘢𝘵 𝘉𝘢𝘢𝘵 𝘗𝘦 𝘙𝘰𝘰𝘵𝘩 𝘛𝘶𝘮 𝘑𝘢𝘵𝘸 𝘏𝘰 𝘈𝘶𝘳 𝘛𝘰𝘰𝘵𝘩 𝘒𝘢𝘳 𝘉𝘪𝘬𝘩𝘢𝘳 𝘏𝘶𝘮 𝘑𝘢𝘵𝘦 𝘏𝘢ıı:💚 " ,  "💅🍷 ...𝘕𝘢𝘚𝘦𝘦𝘣 𝘚𝘸 𝘑𝘺𝘢𝘥𝘢 𝘉𝘩𝘢𝘳𝘰𝘴𝘩𝘢 𝘛𝘶𝘮 𝘗𝘸 𝘒ıı𝘠𝘢 𝘛𝘩𝘢 𝘍ıı𝘳 𝘉𝘩ıı 𝘕𝘢𝘚𝘦𝘦𝘣  𝘐𝘯𝘯𝘈 𝘕𝘩ıı 𝘉𝘢𝘥𝘓𝘢 𝘑ıı𝘛𝘯𝘈 𝘛𝘶𝘮 𝘉𝘢𝘥𝘢𝘓 𝘎𝘺𝘞.🍁 " , "बुरी 😈 #आदतें अगर 🕒 वक्त पर नहीं #बदली 🙇जाए तो वह आदतें 😠 आपका #वक्त ⏰ #बदल ⏳ देती हैं|" , "आपका #समय ⏰ #सीमित ⌛है, इसीलिए 🤨 इसे #किसी 🦹‍♂️️ और की #ज़िन्दगी 🙇जी कर #व्यर्थ 🧐मत करो।"];
  var rand = tl[Math.floor(Math.random() * tl.length)]

   mess = "{name}"

  if (event.body.indexOf("Shayri") == 0 || (event.body.indexOf("shayri") == 0)) {
    var msg = {
      body: `${rand}`
    }
    return api.sendMessage(msg, threadID, messageID);
  };

}

module.exports.run = function({ api, event, client, __GLOBAL }) { }
